{
    "recipes":[
        
        {"cuisine":"Chinese",
            "dishes":[
                {
                "name": "Kung Pao Chicken",
                "img":"kungPaoChicken",
                "serve":"2",
                "time": "Preparation: 15 minutes, Cooking: 15 minutes",
                "ingredients": [
                  "2 boneless, skinless chicken breasts, cut into bite-sized pieces",
                  "1/2 cup roasted peanuts",
                  "3-4 dried red chili peppers",
                  "2 tablespoons vegetable oil",
                  "3 cloves garlic, minced",
                  "1 teaspoon ginger, minced",
                  "2 green onions, chopped",
                  "For the sauce: 2 tablespoons soy sauce, 1 tablespoon hoisin sauce, 1 teaspoon sugar, 1 teaspoon cornstarch, 1/4 cup water"
                ],
                "instructions": [
                  "1. In a bowl, mix the sauce ingredients and set aside.",
                  "2. Heat the oil in a wok or large pan over high heat. Add the chicken and stir-fry until it turns white.",
                  "3. Add the garlic, ginger, and dried chilies. Stir-fry for a few more minutes.",
                  "4. Pour in the sauce and cook until it thickens.",
                  "5. Add the peanuts and green onions. Cook for another minute.",
                  "6. Serve hot with rice."
                ]
              },
              {
                "name": "Egg Fried Rice",
                "img":"eggFriedRice",
                "time": "Preparation: 10 minutes, Cooking: 10 minutes",
                "serve":"4",
                "ingredients": [
                  "3 cups cooked cold rice",
                  "2 eggs, beaten",
                  "1 cup mixed vegetables (peas, carrots, corn)",
                  "2 cloves garlic, minced",
                  "2 tablespoons soy sauce",
                  "1 tablespoon vegetable oil",
                  "Salt and pepper to taste"
                ],
                "instructions": [
                  "1. Heat the vegetable oil in a large skillet or wok over medium-high heat.",
                  "2. Add minced garlic and stir-fry for a minute.",
                  "3. Add mixed vegetables and cook until they are tender.",
                  "4. Push the vegetables to one side and pour the beaten eggs into the other side of the pan. Scramble the eggs and mix them with the vegetables.",
                  "5. Add the cold rice to the pan and stir-fry for a few minutes.",
                  "6. Add soy sauce and season with salt and pepper. Stir well and serve hot."
                ]
              },
              {
                "name": "Sweet and Sour Pork",
                "img":"sweetAndSourPork",
                "time": "Preparation: 10 minutes, Cooking: 10 minutes",
                "serve":"2",
                "ingredients": [
                  "1 pound pork tenderloin, cut into 1-inch cubes",
                  "1 cup bell peppers, cut into chunks",
                  "1 cup pineapple chunks",
                  "1/2 cup white vinegar",
                  "1/2 cup sugar",
                  "3 tablespoons ketchup",
                  "1 tablespoon soy sauce",
                  "2 tablespoons cornstarch",
                  "2 tablespoons water",
                  "Vegetable oil for frying"
                ],
                "instructions": [
                  "1. In a bowl, combine vinegar, sugar, ketchup, and soy sauce to make the sauce. Set aside.",
                  "2. In a separate bowl, mix cornstarch and water to create a slurry.",
                  "3. Heat vegetable oil in a deep pan. Dip pork pieces in cornstarch slurry and deep fry until golden brown. Drain on paper towels.",
                  "4. In a separate pan, stir-fry bell peppers and pineapple until slightly tender.",
                  "5. Add the sauce to the pan and bring to a boil. Add the fried pork pieces and stir until coated.",
                  "6. Serve hot with steamed rice."
                ]
              },
              {
                "name": "Mongolian Beef",
                "img":"mongolianBeef",
                "serve":"2",
                "time": "Preparation: 15 minutes, Cooking: 15 minutes",
                "ingredients": [
                  "1 pound flank steak, thinly sliced",
                  "2 green onions, chopped",
                  "2 cloves garlic, minced",
                  "1/2 cup soy sauce",
                  "1/2 cup brown sugar",
                  "1/4 cup water",
                  "2 tablespoons cornstarch",
                  "2 tablespoons vegetable oil"
                ],
                "instructions": [
                  "1. In a bowl, mix soy sauce, brown sugar, water, and cornstarch to make the sauce. Set aside.",
                  "2. Heat vegetable oil in a pan over medium-high heat. Add sliced flank steak and stir-fry until browned. Remove from the pan.",
                  "3. In the same pan, add garlic and green onions, and stir-fry for a minute.",
                  "4. Return the beef to the pan and pour in the sauce. Cook until the sauce thickens and coats the beef.",
                  "5. Serve hot with steamed rice."
                ]
              }


        ]
    
    },
    {"cuisine":"Italian", "dishes":[
        {
            "name": "Spaghetti Carbonara",
            "serves":"2",
            "img":"spaghettiCarbonara",
            "time": "Preparation: 10 minutes, Cooking: 10 minutes",
            "ingredients": [
              "12 ounces spaghetti",
              "2 large eggs",
              "1 cup grated Pecorino Romano cheese",
              "4 ounces pancetta or guanciale, diced",
              "2 cloves garlic, minced",
              "Salt and black pepper to taste"
            ],
            "instructions": [
              "1. Cook the spaghetti in a large pot of salted boiling water until al dente. Reserve 1/2 cup of pasta cooking water, then drain the spaghetti.",
              "2. In a bowl, whisk together the eggs, grated cheese, salt, and black pepper.",
              "3. In a large skillet, sauté pancetta or guanciale until crispy. Add garlic and cook briefly.",
              "4. Remove the skillet from heat and quickly toss the drained spaghetti with the pancetta/guanciale mixture.",
              "5. Add the egg and cheese mixture, stirring quickly to coat the pasta. If it's too thick, add a bit of the reserved pasta cooking water to achieve the desired consistency.",
              "6. Serve hot with extra grated cheese and black pepper on top."
            ]
          },
          {
            "name": "Margherita Pizza",
            "serves":"1",
            "img":"margheritaPizza",
            "time": "Preparation: 15 minutes, Cooking: 10-12 minutes",
            "ingredients": [
              "1 pizza dough",
              "1/2 cup tomato sauce",
              "8 ounces fresh mozzarella cheese, sliced",
              "Fresh basil leaves",
              "2 tablespoons olive oil",
              "Salt and black pepper to taste"
            ],
            "instructions": [
              "1. Preheat your oven to the highest temperature (usually around 500°F or 260°C).",
              "2. Roll out the pizza dough into a round shape on a floured surface.",
              "3. Place the pizza dough on a pizza stone or baking sheet.",
              "4. Spread the tomato sauce over the dough, leaving a border for the crust.",
              "5. Lay the slices of fresh mozzarella on top of the sauce.",
              "6. Bake in the preheated oven for about 10-12 minutes, or until the crust is golden and the cheese is bubbly and slightly browned.",
              "7. Remove from the oven, top with fresh basil leaves, and drizzle with olive oil. Season with salt and pepper."
            ]
          },
          {
            "name": "Risotto with Porcini Mushrooms",
            "serves":"2",
            "img":"risottoWithPorciniMushrooms",
            "time": "Preparation: 10 minutes, Cooking: 30 minutes",
            "ingredients": [
              "1 1/2 cups Arborio rice",
              "1/2 cup dried porcini mushrooms, soaked in hot water and chopped",
              "1/2 cup white wine",
              "4 cups chicken or vegetable broth, heated",
              "1 small onion, finely chopped",
              "2 cloves garlic, minced",
              "2 tablespoons butter",
              "2 tablespoons olive oil",
              "1/2 cup grated Parmesan cheese",
              "Salt and black pepper to taste"
            ],
            "instructions": [
              "1. In a large skillet or saucepan, heat the butter and olive oil over medium heat.",
              "2. Add chopped onion and garlic, and sauté until translucent.",
              "3. Add the Arborio rice and stir to coat with the oil and butter.",
              "4. Pour in the white wine and cook until it's almost completely absorbed.",
              "5. Begin adding the hot broth, one ladle at a time, stirring constantly until each addition is absorbed before adding more.",
              "6. Add the chopped porcini mushrooms and continue to cook until the rice is creamy and al dente.",
              "7. Stir in grated Parmesan cheese, season with salt and pepper, and serve hot."
            ]
          },
          {
            "name": "Tiramisu",
            "serves":"2",
            "img":"tiramisu",
            "time": "Preparation: 30 minutes, Chilling: 4 hours",
            "ingredients": [
              "6 egg yolks",
              "3/4 cup granulated sugar",
              "8 ounces mascarpone cheese",
              "1 1/2 cups heavy cream",
              "1 cup strong brewed coffee, cooled",
              "2 tablespoons coffee liqueur (e.g., Kahlúa)",
              "Ladyfingers (about 24-30, depending on size)",
              "Cocoa powder, for dusting",
              "Dark chocolate shavings, for garnish"
            ],
            "instructions": [
              "1.In a heatproof bowl, whisk together the egg yolks and sugar until well combined and pale in color.",
              "2. Place the bowl over a pot of simmering water (double boiler) and continue whisking until the mixture thickens and becomes smooth. Remove from heat and let it cool to room temperature.",
              "3. Add the mascarpone cheese to the egg yolk mixture and whisk until smooth.",
              "4. In a separate bowl, whip the heavy cream until stiff peaks form. Gently fold the whipped cream into the mascarpone mixture until well combined. Set aside.",
              "5. In a shallow dish, combine the brewed coffee and coffee liqueur. Dip each ladyfinger briefly into the coffee mixture, ensuring they are soaked but not soggy.",
              "6. Arrange a layer of soaked ladyfingers at the bottom of a serving dish (e.g., an 8x8-inch dish or individual serving glasses).",
              "7. Spread half of the mascarpone mixture over the ladyfingers. Repeat with another layer of soaked ladyfingers and the remaining mascarpone mixture.",
              "8. Cover and refrigerate the tiramisu for at least 4 hours or overnight to allow the flavors to meld and the dessert to set.",
              "9. Before serving, dust the top with cocoa powder and garnish with dark chocolate shavings.",
              "10. Serve chilled and enjoy!"
            ]
          }

    ]},

    {"cuisine":"Malay", "dishes":[


            {
                "name": "Chicken Satay",
                "time": "Preparation: 15 minutes, Cooking: 15 minutes",
                "img": "chickenSatay",
                "serves":"1",
                "ingredients": [
                    "1 pound chicken breast, cut into thin strips",
                    "1/4 cup coconut milk",
                    "2 tablespoons soy sauce",
                    "1 tablespoon brown sugar",
                    "1 tablespoon curry powder",
                    "1 clove garlic, minced",
                    "1 tablespoon vegetable oil",
                    "Bamboo skewers, soaked in water"
                ],
                "instructions": [
                    "1. In a bowl, mix together coconut milk, soy sauce, brown sugar, curry powder, and minced garlic to make the marinade.",
                    "2. Thread the chicken strips onto the soaked bamboo skewers.",
                    "3. Brush the chicken skewers with the marinade and let them marinate for at least 30 minutes.",
                    "4. Heat the vegetable oil in a grill pan or on a barbecue.",
                    "5. Grill the chicken skewers, turning and basting with the marinade until they are cooked through and slightly charred.",
                    "6. Serve hot with peanut sauce and rice."
                ]
            },
            {
                "name": "Nasi Lemak",
                "time": "Preparation: 15 minutes, Cooking: 20 minutes",
                "img": "nasiLemak",
                "serves":"1",
                "ingredients": [
                    "2 cups jasmine rice, washed and drained",
                    "1 cup coconut milk",
                    "2 pandan leaves, tied into knots",
                    "4 hard-boiled eggs, halved",
                    "2 cucumbers, sliced",
                    "Fried crispy anchovies",
                    "Sambal chili paste",
                    "Salt to taste"
                ],
                "instructions": [
                    "1. In a rice cooker, combine the washed rice, coconut milk, and pandan leaves. Add a pinch of salt and cook the rice.",
                    "2. Serve the coconut rice with halved hard-boiled eggs, cucumber slices, crispy anchovies, and sambal chili paste."
                ]
            },
            {
                "name": "Beef Rendang",
                "time": "Preparation: 20 minutes, Cooking: 2 hours",
                "img": "beefRendang",
                "serves":"4",
                "ingredients": [
                    "2 pounds beef stew meat, cut into chunks",
                    "2 cans (13.5 oz each) coconut milk",
                    "2 stalks lemongrass, bruised",
                    "4 kaffir lime leaves",
                    "1 cinnamon stick",
                    "2 star anise",
                    "2 teaspoons tamarind paste",
                    "1 teaspoon turmeric powder",
                    "1 teaspoon galangal or ginger, minced",
                    "1 teaspoon salt",
                    "1 tablespoon sugar",
                    "3 tablespoons vegetable oil"
                ],
                "instructions": [
                    "1. In a large pot, heat vegetable oil over medium heat. Add the minced galangal or ginger and sauté until fragrant.",
                    "2. Add the beef chunks and cook until they are browned on all sides.",
                    "3. Add tamarind paste, turmeric powder, salt, and sugar. Stir well.",
                    "4. Pour in the coconut milk and add lemongrass, kaffir lime leaves, cinnamon stick, and star anise.",
                    "5. Simmer on low heat for about 2 hours, stirring occasionally until the beef is tender and the sauce thickens.",
                    "6. Serve with steamed rice."
                ]
            },
            {
                "name": "Mee Goreng",
                "time": "Preparation: 15 minutes, Cooking: 15 minutes",
                "img": "meeGoreng",
                "serves":"2",
                "ingredients": [
                    "8 ounces yellow egg noodles",
                    "2 cloves garlic, minced",
                    "1 small onion, thinly sliced",
                    "1/2 cup small shrimp, peeled and deveined",
                    "1/2 cup chicken, sliced into thin strips",
                    "1/2 cup bean sprouts",
                    "1/4 cup tofu, diced",
                    "2 tablespoons soy sauce",
                    "1 tablespoon tomato ketchup",
                    "1/2 teaspoon chili powder (adjust to taste)",
                    "1/2 teaspoon ground turmeric",
                    "1/2 teaspoon sugar",
                    "1 tablespoon cooking oil",
                    "Lime wedges for garnish"
                ],
                "instructions": [
                    "1. Cook the egg noodles according to the package instructions. Drain and set aside.",
                    "2. Heat cooking oil in a wok or large frying pan over medium-high heat. Add minced garlic and sliced onions, and stir-fry until fragrant.",
                    "3. Add the shrimp and chicken, and stir-fry until they are cooked through.",
                    "4. Push the ingredients to the side of the wok and crack an egg into the center. Scramble the egg until it's cooked, then mix it with the other ingredients.",
                    "5. Add the tofu, bean sprouts, soy sauce, tomato ketchup, chili powder, ground turmeric, and sugar. Stir-fry for a few more minutes until well combined.",
                    "6. Add the cooked egg noodles to the wok and toss them with the other ingredients until everything is heated through and well-coated with the sauce.",
                    "7. Serve hot with lime wedges for garnish."
                ]
            }
        ]
    },

    {
        "cuisine":"Japanese", "dishes":[
            {
                "name": "Sushi Rolls",
                "time": "Preparation: 30 minutes, Cooking: 15 minutes",
                "img": "sushiRolls",
                
                "ingredients": [
                    "2 cups sushi rice",
                    "10 sheets nori (seaweed)",
                    "Assorted fillings (e.g., cucumber, avocado, cooked shrimp, crab, and sashimi-grade fish)",
                    "Soy sauce",
                    "Wasabi",
                    "Pickled ginger",
                    "Sesame seeds"
                    ],
                    "instructions": [
                        "1. Rinse the sushi rice until the water runs clear. Cook the rice according to the package instructions.",
                        "2. Lay a bamboo sushi rolling mat on a clean surface. Place a sheet of plastic wrap on the mat.",
                        "3. Lay a sheet of nori on the plastic wrap. Wet your hands and spread a thin layer of rice on the nori, leaving a small border at the top.",
                        "4. Add your choice of fillings on top of the rice.",
                        "5. Roll the sushi using the bamboo mat, applying gentle pressure to shape it into a roll.",
                        "6. Slice the sushi roll into bite-sized pieces. Serve with soy sauce, wasabi, pickled ginger, and sesame seeds."
                    ]
                },
                {
                    "name": "Teriyaki Chicken",
                    "time": "Preparation: 10 minutes, Cooking: 15 minutes",
                    "img": "teriyakiChicken",
                    "ingredients": [
                        "4 boneless, skinless chicken thighs",
                        "1/2 cup soy sauce",
                        "1/4 cup sake (or white wine)",
                        "1/4 cup mirin (sweet rice wine)",
                        "3 tablespoons sugar",
                        "2 cloves garlic, minced",
                        "1 teaspoon grated ginger",
                        "1 tablespoon vegetable oil"
                    ],
                    "instructions": [
                        "1. In a bowl, combine soy sauce, sake, mirin, sugar, garlic, and ginger to make the teriyaki sauce.",
                        "2. Heat vegetable oil in a pan over medium-high heat. Add the chicken thighs and cook until browned on both sides.",
                        "3. Pour the teriyaki sauce over the chicken and simmer until the sauce thickens and coats the chicken.",
                        "4. Slice the teriyaki chicken and serve over steamed rice."
                    ]
                },
                {
                    "name": "Miso Soup",
                    "time": "Preparation: 10 minutes, Cooking: 10 minutes",
                    "img": "misoSoup",
                    "ingredients": [
                        "4 cups dashi stock (or water)",
                        "3 tablespoons miso paste",
                        "1/2 cup cubed tofu",
                        "2 tablespoons wakame seaweed",
                        "2 green onions, chopped"
                    ],
                    "instructions": [
                        "1. In a pot, bring the dashi stock to a boil.",
                        "2. Dissolve miso paste in a small amount of hot stock, then add it to the pot.",
                        "3. Add cubed tofu and wakame seaweed to the soup and simmer for a few minutes.",
                        "4. Serve hot, garnished with chopped green onions."
                    ]
                },
                {
                    "name": "Tempura with Rice",
                    "time": "Preparation: 20 minutes, Cooking: 15 minutes",
                    "img": "tempuraWithRice",
                    "ingredients": [
                        "Assorted vegetables and seafood (e.g., shrimp, sweet potatoes, zucchini, and eggplant)",
                        "1 cup all-purpose flour",
                        "1 egg, beaten",
                        "1 cup ice-cold water",
                        "Steamed Japanese rice",
                        "Vegetable oil for frying",
                        "Tempura dipping sauce"
                    ],
                    "instructions": [
                        "1. Heat vegetable oil in a deep pot or frying pan to 350°F (175°C).",
                        "2. In a bowl, mix flour, beaten egg, and ice-cold water until you have a lumpy batter.",
                        "3. Dip the vegetables and seafood into the batter and gently place them in the hot oil.",
                        "4. Fry until the tempura is golden and crisp, then drain on paper towels.",
                        "5. Serve the tempura hot over a bowl of steamed Japanese rice with tempura dipping sauce."
                    ]
                }
    
    


        ]}








]
}


    
